{
    "dialogues": [
        {
            "character": "Kite",
            "opening": "H-h-h-ello detective. Do you mind if we play a game?",
            "positive": [
                "Sometimes, I heard shouting coming from the Grey house.",
                "Last night, I found Ms. Grey passed out with a glass in her hand.",
                "Professor Vanth helped Ms. Grey with her groceries."
            ],
            "negative": [
                "I'm surprised an adult like you could not jump over that.",
                "AHAHAHA that one was pretty hard.",
                "Okay sorry, maybe we should have slowed down."
            ],
            "closing": "Closing line"
        },
        {
            "character": "Dr. Grey",
            "opening": "Good evening detective. Surely you can do these simple diagnoses?",
            "positive": [
                "Last night, me and my wife were at Patrica's, before it happened.",
                "These past few months, have been difficult for me to say the least.",
                "What is so great about that snarky bastard Professor Vanth anyways?"
            ],
            "negative": [
                "Are you serious? My dog could have diagnosed that.",
                "It seems I greatly overestimated your intelligence.",
                "Your utter incompetence astounds me detective."
            ],
            "closing": "Closing line"
        },
        {
            "character": "Patrica",
            "opening": "Hello detective. Show me you know how to handle yourself.",
            "positive": [
                "I have not seen Dr. Grey in months. He is a busy man afterall.",
                "I frequently served Ms. Grey and Professor Vanth.",
                "Last night, Ms. Grey and Professor Vanth drank more than usual. It was disgusting."
            ],
            "negative": [
                "Common detective, even Kite is more useful than that.",
                "You do realise food is not meant to be on the floor?",
                "Please clean up after yourself detective."
            ],
            "closing": "Closing line"
        },
        {
            "character": "Professor Vanth",
            "opening": "As a detective, I am sure these logic puzzles will be easy for you?",
            "positive": [
                "Last night, I was celebrating a recent publication with Ms. Grey.",
                "I-I will miss having her company, she was an amazing woman.",
                "Dr. Grey never treated her right, she always felt neglected by him. "
            ],
            "negative": [
                "That was rather trivial. Are you feeling okay detective?",
                "Seriously detective, your logical deduction skills are lacking.",
                "Are you sure you can handle this line of work detective?"
            ],
            "closing": "Closing line"
        }
    ]
}