{
    "dialogues": [
        {
            "character": "Kite",
            "opening": "H-h-h-ello, detective. Do you want to play a game?",
            "positive": [
                "S-s-sometimes, I heard screaming coming from Ms. Grey's house.",
                "Professor Vanth helped Ms. Grey buy her groceries while Dr. Grey was working.",
                "I-I-I don't think Dr. Grey liked Professor Vanth. I am not sure why, he is amazing - he fixed my computer."
            ],
            "negative": [
                "Oh no, that looked a bit difficult for your detective!",
                "Hahaha that one was quite tricky.",
                "Sorry, detective, maybe we should have slowed down. I got carried away."
            ]
        },
        {
            "character": "Dr. Grey", 
            "opening": "Good evening detective. Surely you can handle a simple diagnosis?",
            "positive": [
                "I was w-w-working the late shift last night. The police told me she was murdered",
                "I always worked hard, but she never appreciated it. She never understood.",
                "Don't get me started on Vanth! He's arrogant, with no real experience. What does anyone see in him?"
            ],
            "negative": [
                "You're here to solve my wife's murder? Even my dog could've done that.",
                "I clearly overestimated your intelligence.",
                "Your incompetence is astounding, detective."
            ]
        },
        {
            "character": "Patrica",
            "opening": "Hello detective. Find Ms. Grey's killer. Show me you are capable.",
            "positive": [
                "Ms. Grey stopped bringing Dr. Grey to my restaurant months ago. He's too busy, I guess.",
                "But she was often with Professor Vanth - he's younger.",
                "They were drinking together for hours last night. It was... uncomfortable."
            ],
            "negative": [
                "Come on, detective. Even my apprentices can do that.",
                "Food isn't supposed to be on the floor, detective.",
                "Please clean up after yourself."
            ]
        },
        {
            "character": "Prof. Vanth",
            "opening": "I trust these puzzles will be easy for you, detective?",
            "positive": [
                "I was with Ms. Grey last night, before she was murdered. We were celebrating my latest publication.",
                "S-s-she was a remarkable woman. I'll miss her.",
                "Dr. Grey was always busy. Ms. Grey hardly saw him. He should've treated her better."
            ],
            "negative": [
                "That was trivial. Are you feeling okay, detective?",
                "Your deduction skills are lacking",
                "Are you sure you’re cut out for this work?"
            ]
        }
    ]
}